In [39]:
import pandas as pd 
import numpy as np
dt = pd.read_csv("Births2015.csv")
dt.head()

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
0,1,2015-01-01,8068,Thu,2015,1,1,1,5
1,2,2015-01-02,10850,Fri,2015,1,2,2,6
2,3,2015-01-03,8328,Sat,2015,1,3,3,7
3,4,2015-01-04,7065,Sun,2015,1,4,4,1
4,5,2015-01-05,11892,Mon,2015,1,5,5,2

In [40]:
dt.tail()
#dt.shape

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
360,361,2015-12-27,7518,Sun,2015,12,361,27,1
361,362,2015-12-28,13100,Mon,2015,12,362,28,2
362,363,2015-12-29,13458,Tue,2015,12,363,29,3
363,364,2015-12-30,13100,Wed,2015,12,364,30,4
364,365,2015-12-31,11608,Thu,2015,12,365,31,5

In [10]:
dt[10:15]

,Unnamed: 0,date,births,wday,year,month,day_of_year,day_of_month,day_of_week
10,11,2015-01-11,7172,Sun,2015,1,11,11,1
11,12,2015-01-12,11479,Mon,2015,1,12,12,2
12,13,2015-01-13,11924,Tue,2015,1,13,13,3
13,14,2015-01-14,12013,Wed,2015,1,14,14,4
14,15,2015-01-15,12339,Thu,2015,1,15,15,5

In [41]:
dt1= dt.iloc[:,1:3]
dt1.head()

         date  births
0  2015-01-01    8068
1  2015-01-02   10850
2  2015-01-03    8328
3  2015-01-04    7065
4  2015-01-05   11892

In [43]:

dt.head()
dt['births'].unique
dt['births'].values
dt['births'].mean()
#dt.mean()

10899.991780821918